src/Enums/мз_ВидыСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>мз_ВидыСтатусов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УспешноеЗавершениеПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтПродолженияПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПроцессаНаСледующийЭтап</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/мз_СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>мз_СтатусыЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мз_ВидыСтатусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпрашиватьПричинуИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВОтборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтатуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/мз_Служебный/Ext/Module.bsl
// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	////////////////////////////////////////////////////////////////////////////////
	// 1. Обновление общих данных.
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура       = "мз_Служебный.ОбновитьДанныеСтатусов";
	
КонецПроцедуры

Процедура ОбновитьДанныеСтатусов() Экспорт
	
	ВидСтПеревод = Перечисления.мз_ВидыСтатусов.ПереводПроцессаНаСледующийЭтап;
    ВидСтУспЗав = Перечисления.мз_ВидыСтатусов.УспешноеЗавершениеПроцесса;
	ВидСтОтказ = Перечисления.мз_ВидыСтатусов.ОтказОтПродолженияПроцесса;
	
	Об = Справочники.мз_СтатусыЗадач.Новая.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтПеревод;
	Об.ИндексСтатуса = 0;
	Об.ОтображатьВОтборе = Истина;
	Об.Записать();
	Об = Справочники.мз_СтатусыЗадач.ВРаботе.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтПеревод;
	Об.ИндексСтатуса = 1;
	Об.ОтображатьВОтборе = Истина;
	Об.Записать();
	Об = Справочники.мз_СтатусыЗадач.Выполненная.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтУспЗав;
	Об.ИндексСтатуса = 2;
	Об.ОтображатьВОтборе = Истина;
	Об.Записать();
	Об = Справочники.мз_СтатусыЗадач.Отложенная.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтПеревод;
	Об.СпрашиватьПричинуИзменения = Истина;
	Об.ИндексСтатуса = 3;
	Об.ОтображатьВОтборе = Истина;
	Об.Записать();
	Об = Справочники.мз_СтатусыЗадач.Отмененная.ПолучитьОбъект();
	Об.ВидСтатуса = ВидСтОтказ;
	Об.СпрашиватьПричинуИзменения = Истина;
	Об.ИндексСтатуса = 4;
	Об.ОтображатьВОтборе = Истина;
	Об.Записать();
	
КонецПроцедуры
